MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mk82fn256vdc15.s
.syntax unified
.cpu cortex-m4
.fpu softvfp
.thumb

.global  g_pfnVectors
.global  Default_Handler

.section  .text.Reset_Handler
    .weak  Reset_Handler
    .type  Reset_Handler, %function

Reset_Handler:
    /* set stack pointer */
    ldr sp, =__stack
    /* Call the clock system intitialization function.*/
    bl  systemPreInit
    /* Call the clock system intitialization function.*/
    bl  systemInit
    /* Call static constructors */
    bl __libc_init_array
    /* Call the application's entry point.*/
    bl  main
    bx  lr

.size  Reset_Handler, .-Reset_Handler

/**
 * @brief  This is the code that gets called when the processor receives an
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 * @param  None
 * @retval None
 */
.section  .text.Default_Handler,"ax",%progbits
Default_Handler:
    Infinite_Loop:
        b  Infinite_Loop
        .size  Default_Handler, .-Default_Handler
        .section  .isr_vector,"a",%progbits
        .type  g_pfnVectors, %object
        .size  g_pfnVectors, .-g_pfnVectors

g_pfnVectors:
    .word  __stack
    .word  Reset_Handler                        /* The reset handler */
    .word  NMI_Handler                          /* The NMI handler */
    .word  HardFault_Handler                    /* The hard fault handler */
    .word  MemManage_Handler                    /* The MPU fault handler */
    .word  BusFault_Handler                     /* The bus fault handler */
    .word  UsageFault_Handler                   /* The usage fault handler */
    .word  0                                    /* Reserved */
    .word  0                                    /* Reserved */
    .word  0                                    /* Reserved */
    .word  0                                    /* Reserved */
    .word  SVC_Handler                          /* SVCall handler */
    .word  DebugMon_Handler                     /* Debug monitor handler */
    .word  0                                    /* Reserved */
    .word  PendSV_Handler                       /* The PendSV handler */
    .word  SysTick_Handler                      /* The SysTick handler */
                                                /* External Interrupts */
    .word  DMA0_DMA16_IRQHandler                /* DMA channel 0,16 transfer complete */
    .word  DMA1_DMA17_IRQHandler                /* DMA channel 1,17 transfer complete */
    .word  DMA2_DMA18_IRQHandler                /* DMA channel 2,18 transfer complete */
    .word  DMA3_DMA19_IRQHandler                /* DMA channel 3,19 transfer complete */
    .word  DMA4_DMA20_IRQHandler                /* DMA channel 4,20 transfer complete */
    .word  DMA5_DMA21_IRQHandler                /* DMA channel 5,21 transfer complete */
    .word  DMA6_DMA22_IRQHandler                /* DMA channel 6,22 transfer complete */
    .word  DMA7_DMA23_IRQHandler                /* DMA channel 7,23 transfer complete */
    .word  DMA8_DMA24_IRQHandler                /* DMA channel 8,24 transfer complete */
    .word  DMA9_DMA25_IRQHandler                /* DMA channel 9,25 transfer complete */
    .word  DMA10_DMA26_IRQHandler               /* DMA channel 10,26 transfer complete */
    .word  DMA11_DMA27_IRQHandler               /* DMA channel 11,27 transfer complete */
    .word  DMA12_DMA28_IRQHandler               /* DMA channel 12,28 transfer complete */
    .word  DMA13_DMA29_IRQHandler               /* DMA channel 13,29 transfer complete */
    .word  DMA14_DMA30_IRQHandler               /* DMA channel 14,30 transfer complete */
    .word  DMA15_DMA31_IRQHandler               /* DMA channel 15,31 transfer complete */
    .word  DMA_Error_IRQHandler                 /* DMA channel 0 - 31 error */
    .word  MCM_IRQHandler                       /* MCM normal interrupt */
    .word  FTFA_IRQHandler                      /* FTFA command complete */
    .word  Read_Collision_IRQHandler            /* FTFA read collision */
    .word  LVD_LVW_IRQHandler                   /* PMC controller low-voltage detect, low-voltage warning */
    .word  LLWU_IRQHandler                      /* Low leakage wakeup unit */
    .word  WDOG_EWM_IRQHandler                  /* Single interrupt vector for  WDOG and EWM */
    .word  TRNG0_IRQHandler                     /* True randon number generator */
    .word  I2C0_IRQHandler                      /* Inter-integrated circuit 0 */
    .word  I2C1_IRQHandler                      /* Inter-integrated circuit 1 */
    .word  SPI0_IRQHandler                      /* Serial peripheral Interface 0 */
    .word  SPI1_IRQHandler                      /* Serial peripheral Interface 1 */
    .word  I2S0_Tx_IRQHandler                   /* Integrated interchip sound 0 transmit interrupt */
    .word  I2S0_Rx_IRQHandler                   /* Integrated interchip sound 0 receive interrupt */
    .word  LPUART0_IRQHandler                   /* LPUART0 receive/transmit/error interrupt */
    .word  LPUART1_IRQHandler                   /* LPUART1 receive/transmit/error interrupt */
    .word  LPUART2_IRQHandler                   /* LPUART2 receive/transmit/error interrupt */
    .word  LPUART3_IRQHandler                   /* LPUART3 receive/transmit/error interrupt */
    .word  LPUART4_IRQHandler                   /* LPUART4 receive/transmit/error interrupt */
    .word  Reserved51_IRQHandler                /* Reserved interrupt */
    .word  Reserved52_IRQHandler                /* Reserved interrupt */
    .word  EMVSIM0_IRQHandler                   /* EMVSIM0 common interrupt */
    .word  EMVSIM1_IRQHandler                   /* EMVSIM1 common interrupt */
    .word  ADC0_IRQHandler                      /* Analog-to-digital converter 0 */
    .word  CMP0_IRQHandler                      /* Comparator 0 */
    .word  CMP1_IRQHandler                      /* Comparator 1 */
    .word  FTM0_IRQHandler                      /* FlexTimer module 0 fault, overflow and channels interrupt */
    .word  FTM1_IRQHandler                      /* FlexTimer module 1 fault, overflow and channels interrupt */
    .word  FTM2_IRQHandler                      /* FlexTimer module 2 fault, overflow and channels interrupt */
    .word  CMT_IRQHandler                       /* Carrier modulator transmitter */
    .word  RTC_IRQHandler                       /* Real time clock */
    .word  RTC_Seconds_IRQHandler               /* Real time clock seconds */
    .word  PIT0CH0_IRQHandler                   /* Periodic interrupt timer 0 channel 0 */
    .word  PIT0CH1_IRQHandler                   /* Periodic interrupt timer 0 channel 1 */
    .word  PIT0CH2_IRQHandler                   /* Periodic interrupt timer 0 channel 2 */
    .word  PIT0CH3_IRQHandler                   /* Periodic interrupt timer 0 channel 3 */
    .word  PDB0_IRQHandler                      /* Programmable delay block */
    .word  USB0_IRQHandler                      /* USB OTG interrupt */
    .word  USBDCD_IRQHandler                    /* USB charger detect */
    .word  Reserved71_IRQHandler                /* Reserved interrupt */
    .word  DAC0_IRQHandler                      /* Digital-to-analog converter 0 */
    .word  MCG_IRQHandler                       /* Multipurpose clock generator */
    .word  LPTMR0_LPTMR1_IRQHandler             /* Single interrupt vector for  Low Power Timer 0 and 1 */
    .word  PORTA_IRQHandler                     /* Port A pin detect interrupt */
    .word  PORTB_IRQHandler                     /* Port B pin detect interrupt */
    .word  PORTC_IRQHandler                     /* Port C pin detect interrupt */
    .word  PORTD_IRQHandler                     /* Port D pin detect interrupt */
    .word  PORTE_IRQHandler                     /* Port E pin detect interrupt */
    .word  SWI_IRQHandler                       /* Software interrupt */
    .word  SPI2_IRQHandler                      /* Serial peripheral Interface 2 */
    .word  Reserved82_IRQHandler                /* Reserved interrupt */
    .word  Reserved83_IRQHandler                /* Reserved interrupt */
    .word  Reserved84_IRQHandler                /* Reserved interrupt */
    .word  Reserved85_IRQHandler                /* Reserved interrupt */
    .word  FLEXIO0_IRQHandler                   /* FLEXIO0 */
    .word  FTM3_IRQHandler                      /* FlexTimer module 3 fault, overflow and channels interrupt */
    .word  Reserved88_IRQHandler                /* Reserved interrupt */
    .word  Reserved89_IRQHandler                /* Reserved interrupt */
    .word  I2C2_IRQHandler                      /* Inter-integrated circuit 2 */
    .word  Reserved91_IRQHandler                /* Reserved interrupt */
    .word  Reserved92_IRQHandler                /* Reserved interrupt */
    .word  Reserved93_IRQHandler                /* Reserved interrupt */
    .word  Reserved94_IRQHandler                /* Reserved interrupt */
    .word  Reserved95_IRQHandler                /* Reserved interrupt */
    .word  Reserved96_IRQHandler                /* Reserved interrupt */
    .word  SDHC_IRQHandler                      /* Secured digital host controller */
    .word  Reserved98_IRQHandler                /* Reserved interrupt */
    .word  Reserved99_IRQHandler                /* Reserved interrupt */
    .word  Reserved100_IRQHandler               /* Reserved interrupt */
    .word  Reserved101_IRQHandler               /* Reserved interrupt */
    .word  Reserved102_IRQHandler               /* Reserved interrupt */
    .word  TSI0_IRQHandler                      /* Touch Sensing Input */
    .word  TPM1_IRQHandler                      /* TPM1 single interrupt vector for all sources */
    .word  TPM2_IRQHandler                      /* TPM2 single interrupt vector for all sources */
    .word  Reserved106_IRQHandler               /* Reserved interrupt */
    .word  I2C3_IRQHandler                      /* Inter-integrated circuit 3 */
    .word  Reserved108_IRQHandler               /* Reserved interrupt */
    .word  Reserved109_IRQHandler               /* Reserved interrupt */
    .word  Reserved110_IRQHandler               /* Reserved interrupt */
    .word  Reserved111_IRQHandler               /* Reserved interrupt */
    .word  Reserved112_IRQHandler               /* Reserved interrupt */
    .word  Reserved113_IRQHandler               /* Reserved interrupt */
    .word  Reserved114_IRQHandler               /* Reserved interrupt */
    .word  Reserved115_IRQHandler               /* Reserved interrupt */
    .word  QuadSPI0_IRQHandler                  /* qspi */
    .word  Reserved117_IRQHandler               /* Reserved interrupt */
    .word  Reserved118_IRQHandler               /* Reserved interrupt */
    .word  Reserved119_IRQHandler               /* Reserved interrupt */
    .word  LTC0_IRQHandler                      /* LP Trusted Cryptography */
    .word  Reserved121_IRQHandler               /* Reserved interrupt */
    .word  Reserved122_IRQHandler               /* Reserved interrupt */
    .word  Default_Handler                      /* 123 */
    .word  Default_Handler                      /* 124 */
    .word  Default_Handler                      /* 125 */
    .word  Default_Handler                      /* 126 */
    .word  Default_Handler                      /* 127 */
    .word  Default_Handler                      /* 128 */
    .word  Default_Handler                      /* 129 */
    .word  Default_Handler                      /* 130 */
    .word  Default_Handler                      /* 131 */
    .word  Default_Handler                      /* 132 */
    .word  Default_Handler                      /* 133 */
    .word  Default_Handler                      /* 134 */
    .word  Default_Handler                      /* 135 */
    .word  Default_Handler                      /* 136 */
    .word  Default_Handler                      /* 137 */
    .word  Default_Handler                      /* 138 */
    .word  Default_Handler                      /* 139 */
    .word  Default_Handler                      /* 140 */
    .word  Default_Handler                      /* 141 */
    .word  Default_Handler                      /* 142 */
    .word  Default_Handler                      /* 143 */
    .word  Default_Handler                      /* 144 */
    .word  Default_Handler                      /* 145 */
    .word  Default_Handler                      /* 146 */
    .word  Default_Handler                      /* 147 */
    .word  Default_Handler                      /* 148 */
    .word  Default_Handler                      /* 149 */
    .word  Default_Handler                      /* 150 */
    .word  Default_Handler                      /* 151 */
    .word  Default_Handler                      /* 152 */
    .word  Default_Handler                      /* 153 */
    .word  Default_Handler                      /* 154 */
    .word  Default_Handler                      /* 155 */
    .word  Default_Handler                      /* 156 */
    .word  Default_Handler                      /* 157 */
    .word  Default_Handler                      /* 158 */
    .word  Default_Handler                      /* 159 */
    .word  Default_Handler                      /* 160 */
    .word  Default_Handler                      /* 161 */
    .word  Default_Handler                      /* 162 */
    .word  Default_Handler                      /* 163 */
    .word  Default_Handler                      /* 164 */
    .word  Default_Handler                      /* 165 */
    .word  Default_Handler                      /* 166 */
    .word  Default_Handler                      /* 167 */
    .word  Default_Handler                      /* 168 */
    .word  Default_Handler                      /* 169 */
    .word  Default_Handler                      /* 170 */
    .word  Default_Handler                      /* 171 */
    .word  Default_Handler                      /* 172 */
    .word  Default_Handler                      /* 173 */
    .word  Default_Handler                      /* 174 */
    .word  Default_Handler                      /* 175 */
    .word  Default_Handler                      /* 176 */
    .word  Default_Handler                      /* 177 */
    .word  Default_Handler                      /* 178 */
    .word  Default_Handler                      /* 179 */
    .word  Default_Handler                      /* 180 */
    .word  Default_Handler                      /* 181 */
    .word  Default_Handler                      /* 182 */
    .word  Default_Handler                      /* 183 */
    .word  Default_Handler                      /* 184 */
    .word  Default_Handler                      /* 185 */
    .word  Default_Handler                      /* 186 */
    .word  Default_Handler                      /* 187 */
    .word  Default_Handler                      /* 188 */
    .word  Default_Handler                      /* 189 */
    .word  Default_Handler                      /* 190 */
    .word  Default_Handler                      /* 191 */
    .word  Default_Handler                      /* 192 */
    .word  Default_Handler                      /* 193 */
    .word  Default_Handler                      /* 194 */
    .word  Default_Handler                      /* 195 */
    .word  Default_Handler                      /* 196 */
    .word  Default_Handler                      /* 197 */
    .word  Default_Handler                      /* 198 */
    .word  Default_Handler                      /* 199 */
    .word  Default_Handler                      /* 200 */
    .word  Default_Handler                      /* 201 */
    .word  Default_Handler                      /* 202 */
    .word  Default_Handler                      /* 203 */
    .word  Default_Handler                      /* 204 */
    .word  Default_Handler                      /* 205 */
    .word  Default_Handler                      /* 206 */
    .word  Default_Handler                      /* 207 */
    .word  Default_Handler                      /* 208 */
    .word  Default_Handler                      /* 209 */
    .word  Default_Handler                      /* 210 */
    .word  Default_Handler                      /* 211 */
    .word  Default_Handler                      /* 212 */
    .word  Default_Handler                      /* 213 */
    .word  Default_Handler                      /* 214 */
    .word  Default_Handler                      /* 215 */
    .word  Default_Handler                      /* 216 */
    .word  Default_Handler                      /* 217 */
    .word  Default_Handler                      /* 218 */
    .word  Default_Handler                      /* 219 */
    .word  Default_Handler                      /* 220 */
    .word  Default_Handler                      /* 221 */
    .word  Default_Handler                      /* 222 */
    .word  Default_Handler                      /* 223 */
    .word  Default_Handler                      /* 224 */
    .word  Default_Handler                      /* 225 */
    .word  Default_Handler                      /* 226 */
    .word  Default_Handler                      /* 227 */
    .word  Default_Handler                      /* 228 */
    .word  Default_Handler                      /* 229 */
    .word  Default_Handler                      /* 230 */
    .word  Default_Handler                      /* 231 */
    .word  Default_Handler                      /* 232 */
    .word  Default_Handler                      /* 233 */
    .word  Default_Handler                      /* 234 */
    .word  Default_Handler                      /* 235 */
    .word  Default_Handler                      /* 236 */
    .word  Default_Handler                      /* 237 */
    .word  Default_Handler                      /* 238 */
    .word  Default_Handler                      /* 239 */

